In [51]:
import numpy as np 
import pandas as pd

In [52]:
myindex = ['이순신', '김유신', '강감찬', '광해군', '연산군']
mycolumns = ['서울', '부산', '광주', '목포', '경주']
mylist = list( 10 * onedata for onedata in range(1, 26))
print(mylist)

[10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 110, 120, 130, 140, 150, 160, 170, 180, 190, 200, 210, 220, 230, 240, 250]

In [53]:
myframe = pd.DataFrame( np.reshape(mylist, (5, 5)), index=myindex, columns = mycolumns  )
myframe

      서울   부산   광주   목포   경주
이순신   10   20   30   40   50
김유신   60   70   80   90  100
강감찬  110  120  130  140  150
광해군  160  170  180  190  200
연산군  210  220  230  240  250

In [54]:
type(myframe)

pandas.core.frame.DataFrame

In [55]:
type(myframe.iloc[0])

pandas.core.series.Series

In [56]:
# 1 행만 Series로 읽어 오기')
result = myframe.iloc[1]
type(result)
result

서울     60
부산     70
광주     80
목포     90
경주    100
Name: 김유신, dtype: int32

In [57]:
# 몇개의 행을 읽어 오기')
result = myframe.iloc[[1,3]]
type(result)
result

      서울   부산   광주   목포   경주
김유신   60   70   80   90  100
광해군  160  170  180  190  200

In [58]:
# 짝수행만 가져 오기')
result = myframe.iloc[0::2]
result

      서울   부산   광주   목포   경주
이순신   10   20   30   40   50
강감찬  110  120  130  140  150
연산군  210  220  230  240  250

In [59]:
# 홀수행만 가져 오기 
# 이순신 행만 Series로 읽어 오기
result = myframe.loc['이순신']
print(type(result))
print(result)

<class 'pandas.core.series.Series'>
서울    10
부산    20
광주    30
목포    40
경주    50
Name: 이순신, dtype: int32

In [60]:
# 이순신 행만 DataFrame으로 읽어 오기
result = myframe.loc[['이순신']]
print(type(result))
result

<class 'pandas.core.frame.DataFrame'>

     서울  부산  광주  목포  경주
이순신  10  20  30  40  50

In [61]:
# 강감찬와 이순신 행 읽어 오기
result = myframe.loc[['이순신', '강감찬']]
type(result)
result

      서울   부산   광주   목포   경주
이순신   10   20   30   40   50
강감찬  110  120  130  140  150

In [62]:
myframe.index

Index(['이순신', '김유신', '강감찬', '광해군', '연산군'], dtype='object')

In [63]:
np.random.choice?

Docstring:
choice(a, size=None, replace=True, p=None)

Generates a random sample from a given 1-D array

.. versionadded:: 1.7.0

.. note::
    New code should use the `~numpy.random.Generator.choice`
    method of a `~numpy.random.Generator` instance instead;
    please see the :ref:`random-quick-start`.

Parameters
----------
a : 1-D array-like or int
    If an ndarray, a random sample is generated from its elements.
    If an int, the random sample is generated as if it were ``np.arange(a)``
size : int or tuple of ints, optional
    Output shape.  If the given shape is, e.g., ``(m, n, k)``, then
    ``m * n * k`` samples are drawn.  Default is None, in which case a
    single value is returned.
replace : boolean, optional
    Whether the sample is with or without replacement. Default is True,
    meaning that a value of ``a`` can be selected multiple times.
p : 1-D array-like, optional
    The probabilities associated with each entry in a.
    If not given, the sample assumes a uniform distribution over all
    entries in ``a``.

Returns
-------
samples : single item or ndarray
    The generated random samples

Raises
------
ValueError
    If a is an int and less than zero, if a or p are not 1-dimensional,
    if a is an array-like of size 0, if p is not a vector of
    probabilities, if a and p have different lengths, or if
    replace=False and the sample size is greater than the population
    size

See Also
--------
randint, shuffle, permutation
random.Generator.choice: which should be used in new code

Notes
-----
Setting user-specified probabilities through ``p`` uses a more general but less
efficient sampler than the default. The general sampler produces a different sample
than the optimized sampler even if each element of ``p`` is 1 / len(a).

Sampling random rows from a 2-D array is not possible with this function,
but is possible with `Generator.choice` through its ``axis`` keyword.

Examples
--------
Generate a uniform random sample from np.arange(5) of size 3:

>>> np.random.choice(5, 3)
array([0, 3, 4]) # random
>>> #This is equivalent to np.random.randint(0,5,3)

Generate a non-uniform random sample from np.arange(5) of size 3:

>>> np.random.choice(5, 3, p=[0.1, 0, 0.3, 0.6, 0])
array([3, 3, 0]) # random

Generate a uniform random sample from np.arange(5) of size 3 without
replacement:

>>> np.random.choice(5, 3, replace=False)
array([3,1,0]) # random
>>> #This is equivalent to np.random.permutation(np.arange(5))[:3]

Generate a non-uniform random sample from np.arange(5) of size
3 without replacement:

>>> np.random.choice(5, 3, replace=False, p=[0.1, 0, 0.3, 0.6, 0])
array([2, 3, 0]) # random

Any of the above can be repeated with an arbitrary array-like
instead of just integers. For instance:

>>> aa_milne_arr = ['pooh', 'rabbit', 'piglet', 'Christopher']
>>> np.random.choice(aa_milne_arr, 5, p=[0.5, 0.1, 0.1, 0.3])
array(['pooh', 'pooh', 'pooh', 'Christopher', 'piglet'], # random
      dtype='<U11')
Type:      builtin_function_or_method

In [64]:
help(np.random.choice)

Help on built-in function choice:

choice(...) method of numpy.random.mtrand.RandomState instance
    choice(a, size=None, replace=True, p=None)

    Generates a random sample from a given 1-D array

    .. versionadded:: 1.7.0

    .. note::
        New code should use the `~numpy.random.Generator.choice`
        method of a `~numpy.random.Generator` instance instead;
        please see the :ref:`random-quick-start`.

    Parameters
    ----------
    a : 1-D array-like or int
        If an ndarray, a random sample is generated from its elements.
        If an int, the random sample is generated as if it were ``np.arange(a)``
    size : int or tuple of ints, optional
        Output shape.  If the given shape is, e.g., ``(m, n, k)``, then
        ``m * n * k`` samples are drawn.  Default is None, in which case a
        single value is returned.
    replace : boolean, optional
        Whether the sample is with or without replacement. Default is True,
        meaning that a value of ``a`` can be selected multiple times.
    p : 1-D array-like, optional
        The probabilities associated with each entry in a.
        If not given, the sample assumes a uniform distribution over all
        entries in ``a``.

    Returns
    -------
    samples : single item or ndarray
        The generated random samples

    Raises
    ------
    ValueError
        If a is an int and less than zero, if a or p are not 1-dimensional,
        if a is an array-like of size 0, if p is not a vector of
        probabilities, if a and p have different lengths, or if
        replace=False and the sample size is greater than the population
        size

    See Also
    --------
    randint, shuffle, permutation
    random.Generator.choice: which should be used in new code

    Notes
    -----
    Setting user-specified probabilities through ``p`` uses a more general but less
    efficient sampler than the default. The general sampler produces a different sample
    than the optimized sampler even if each element of ``p`` is 1 / len(a).

    Sampling random rows from a 2-D array is not possible with this function,
    but is possible with `Generator.choice` through its ``axis`` keyword.

    Examples
    --------
    Generate a uniform random sample from np.arange(5) of size 3:

    >>> np.random.choice(5, 3)
    array([0, 3, 4]) # random
    >>> #This is equivalent to np.random.randint(0,5,3)

    Generate a non-uniform random sample from np.arange(5) of size 3:

    >>> np.random.choice(5, 3, p=[0.1, 0, 0.3, 0.6, 0])
    array([3, 3, 0]) # random

    Generate a uniform random sample from np.arange(5) of size 3 without
    replacement:

    >>> np.random.choice(5, 3, replace=False)
    array([3,1,0]) # random
    >>> #This is equivalent to np.random.permutation(np.arange(5))[:3]

    Generate a non-uniform random sample from np.arange(5) of size
    3 without replacement:

    >>> np.random.choice(5, 3, replace=False, p=[0.1, 0, 0.3, 0.6, 0])
    array([2, 3, 0]) # random

    Any of the above can be repeated with an arbitrary array-like
    instead of just integers. For instance:

    >>> aa_milne_arr = ['pooh', 'rabbit', 'piglet', 'Christopher']
    >>> np.random.choice(aa_milne_arr, 5, p=[0.5, 0.1, 0.1, 0.3])
    array(['pooh', 'pooh', 'pooh', 'Christopher', 'piglet'], # random
          dtype='<U11')

In [65]:
mytarget = np.random.choice(myframe.index, 3)
mytarget

array(['강감찬', '광해군', '강감찬'], dtype=object)

In [66]:
result = myframe.loc[ mytarget ]
result

      서울   부산   광주   목포   경주
강감찬  110  120  130  140  150
광해군  160  170  180  190  200
강감찬  110  120  130  140  150

In [22]:
# 강감찬의  광주 실적 정보 가져 오기
result = myframe.loc[['강감찬'], ['광주']] # DataFrame
result
result = myframe.loc['강감찬', '광주']
result

130

In [18]:
# 연산군와 광해군의 광주/목포 정보 가져 오기
result = myframe.loc[['연산군', '강감찬'], ['광주', '목포']]
result

      광주   목포
연산군  230  240
강감찬  130  140

In [19]:
# 연속적인 데이터 가져 오기
result = myframe.loc['김유신':'광해군', '광주':'목포']
result

      광주   목포
김유신   80   90
강감찬  130  140
광해군  180  190

In [20]:
# 김유신~광해군까지  부산 실적 정보 가져 오기
result = myframe.loc['김유신':'광해군', ['부산']]
result

      부산
김유신   70
강감찬  120
광해군  170

In [21]:
# Boolean으로 데이터 처리하기
result = myframe.loc[[False, True, True, False, True]]
result

      서울   부산   광주   목포   경주
김유신   60   70   80   90  100
강감찬  110  120  130  140  150
연산군  210  220  230  240  250

In [22]:
# 부산 실적이 100이하인 항목들
result = myframe.loc[ myframe['부산'] <= 100 ]
result

     서울  부산  광주  목포   경주
이순신  10  20  30  40   50
김유신  60  70  80  90  100

In [23]:
# 목포 실적이 140인 항목들
result = myframe.loc[ myframe['목포'] == 140 ]
result

      서울   부산   광주   목포   경주
강감찬  110  120  130  140  150

In [44]:
cond1 = myframe['부산'] >= 70
cond2 = myframe['목포'] >= 140

type(cond1)

pandas.core.series.Series

In [45]:
cond1

이순신    False
김유신     True
강감찬     True
광해군     True
연산군     True
Name: 부산, dtype: bool

In [46]:
cond2

이순신    False
김유신    False
강감찬     True
광해군     True
연산군     True
Name: 목포, dtype: bool

In [47]:
df = pd.DataFrame([cond1, cond2])
df

      이순신    김유신   강감찬   광해군   연산군
부산  False   True  True  True  True
목포  False  False  True  True  True

In [32]:
df.all?

Signature:
df.all(
    axis: 'Axis | None' = 0,
    bool_only: 'bool' = False,
    skipna: 'bool' = True,
    **kwargs,
) -> 'Series | bool'
Docstring:
Return whether all elements are True, potentially over an axis.

Returns True unless there at least one element within a series or
along a Dataframe axis that is False or equivalent (e.g. zero or
empty).

Parameters
----------
axis : {0 or 'index', 1 or 'columns', None}, default 0
    Indicate which axis or axes should be reduced. For `Series` this parameter
    is unused and defaults to 0.

    * 0 / 'index' : reduce the index, return a Series whose index is the
      original column labels.
    * 1 / 'columns' : reduce the columns, return a Series whose index is the
      original index.
    * None : reduce all axes, return a scalar.

bool_only : bool, default False
    Include only boolean columns. Not implemented for Series.
skipna : bool, default True
    Exclude NA/null values. If the entire row/column is NA and skipna is
    True, then the result will be True, as for an empty row/column.
    If skipna is False, then NA are treated as True, because these are not
    equal to zero.
**kwargs : any, default None
    Additional keywords have no effect but might be accepted for
    compatibility with NumPy.

Returns
-------
Series or DataFrame
    If level is specified, then, DataFrame is returned; otherwise, Series
    is returned.

See Also
--------
Series.all : Return True if all elements are True.
DataFrame.any : Return True if one (or more) elements are True.

Examples
--------
**Series**

>>> pd.Series([True, True]).all()
True
>>> pd.Series([True, False]).all()
False
>>> pd.Series([], dtype="float64").all()
True
>>> pd.Series([np.nan]).all()
True
>>> pd.Series([np.nan]).all(skipna=False)
True

**DataFrames**

Create a dataframe from a dictionary.

>>> df = pd.DataFrame({'col1': [True, True], 'col2': [True, False]})
>>> df
   col1   col2
0  True   True
1  True  False

Default behaviour checks if values in each column all return True.

>>> df.all()
col1     True
col2    False
dtype: bool

Specify ``axis='columns'`` to check if values in each row all return True.

>>> df.all(axis='columns')
0     True
1    False
dtype: bool

Or ``axis=None`` for whether every value is True.

>>> df.all(axis=None)
False
File:      d:\kdt_2\anaconda3\lib\site-packages\pandas\core\frame.py
Type:      method

In [39]:
df.all(axis=0)

이순신    False
김유신    False
강감찬     True
광해군     True
연산군     True
dtype: bool

In [40]:
df.any()

이순신    False
김유신     True
강감찬     True
광해군     True
연산군     True
dtype: bool

In [41]:
result = myframe.loc[ df.all() ]
result

      서울   부산   광주   목포   경주
강감찬  110  120  130  140  150
광해군  160  170  180  190  200
연산군  210  220  230  240  250

In [42]:
result = myframe.loc[ df.any() ]
result

      서울   부산   광주   목포   경주
김유신   60   70   80   90  100
강감찬  110  120  130  140  150
광해군  160  170  180  190  200
연산군  210  220  230  240  250

In [50]:
myframe

      서울   부산   광주   목포   경주
이순신   10   20   30   40   50
김유신   60   70   80   90  100
강감찬  110  120  130  140  150
광해군  160  170  180  190  200
연산군  210  220  230  240  250

In [48]:
# 람다 함수의 사용
result = myframe.loc[ lambda df : df['광주'] >= 130  ]
result

      서울   부산   광주   목포   경주
강감찬  110  120  130  140  150
광해군  160  170  180  190  200
연산군  210  220  230  240  250

In [33]:
# 이순신과 강감찬의 부산 실적을 30으로 변경하기
myframe.loc[['이순신', '강감찬'], ['부산']] = 30
myframe

      서울   부산   광주   목포   경주
이순신   10   30   30   40   50
김유신   60   70   80   90  100
강감찬  110   30  130  140  150
광해군  160  170  180  190  200
연산군  210  220  230  240  250

In [34]:
## 김유신부터 광해군까지 경주 실적을 80으로 변경하시오.
myframe.loc['김유신':'광해군', ['경주']] = 80
myframe

      서울   부산   광주   목포   경주
이순신   10   30   30   40   50
김유신   60   70   80   90   80
강감찬  110   30  130  140   80
광해군  160  170  180  190   80
연산군  210  220  230  240  250

In [35]:
# 연산군의 모든 실적을 50으로 변경하기
myframe.loc[['연산군'], :] = 50
myframe

      서울   부산   광주   목포  경주
이순신   10   30   30   40  50
김유신   60   70   80   90  80
강감찬  110   30  130  140  80
광해군  160  170  180  190  80
연산군   50   50   50   50  50

In [36]:
# 모든 사람의 광주 컬럼을 60으로 변경하기
myframe.loc[:, ['광주']] = 60
myframe

      서울   부산  광주   목포  경주
이순신   10   30  60   40  50
김유신   60   70  60   90  80
강감찬  110   30  60  140  80
광해군  160  170  60  190  80
연산군   50   50  60   50  50

In [37]:
# 경주 실적이 150이하인 데이터를 모두 0으로 변경하기
myframe.loc[myframe['경주'] <= 150 , ['경주', '광주']] = 0
myframe

      서울   부산  광주   목포  경주
이순신   10   30   0   40   0
김유신   60   70   0   90   0
강감찬  110   30   0  140   0
광해군  160  170   0  190   0
연산군   50   50   0   50   0

In [38]:
# 데이터 프레임 사용하기
myframe

      서울   부산  광주   목포  경주
이순신   10   30   0   40   0
김유신   60   70   0   90   0
강감찬  110   30   0  140   0
광해군  160  170   0  190   0
연산군   50   50   0   50   0